from .helpers import create_delivery_date


answer_text_data = ["Сутки — 400 рублей. Оплата курьеру — наличными или картой.",

                    "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями,"                   
                    " можете просто сделать несколько заказов — один за другим.",

                    "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня."
                    " Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру."
                    " Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",

                    "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",

                    "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому"
                    " номеру 1010.",

                    "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если"
                    " будете кататься без передышек и во сне. Зарядка не понадобится.",

                    "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим."
                    " Все же свои.",

                    "Да, обязательно. Всем самокатов! И Москве, и Московской области."]

ORDER_DATA_1_SET = {
    "name": "Николай",
    "last_name": "Петров",
    "address": "Техноград, д.25, кв.1",
    "metro": "Китай-город",
    "phone": "+78003553535",
    "date": f"{create_delivery_date(1)}",
    "renta_period": "сутки",
    "color": "grey",
    "comment": "Домофон"
}
ORDER_DATA_2_SET = {
    "name": "Григорий",
    "last_name": "Никифоров",
    "address": "Ямская, д.100, кв.15",
    "metro": "Сокольники",
    "phone": "88005671234",
    "date": f"{create_delivery_date(5)}",
    "renta_period": "пятеро суток",
    "color": "black",
    "comment": "Позвонить по телефону"
}
popup_message = 'Номер заказа'
